Repository: MhdSyrwan/IDE_translations
Catalog: Resources_*.po
Languages: hu

source: Arduino cannot run because it could not create a folder to store your sketchbook.
hu: Arduino nem futtathatĂł, mert nem hozhatĂł lĂ©tre a felhasznĂˇlĂłi Sketch mentĂ©sek mappĂˇja.

source: Select (or create new) folder for sketches...
hu: VĂˇlassz (vagy hozz lĂ©tre) mappĂˇt a Sketch-eknek...

source: Problem Opening URL
hu: Hiba az URL megnyitĂˇsakor

source: Could not open the URL {0}
hu: Nem nyithatĂł meg az URL: {0}

source: Problem Opening Folder
hu: Hiba a mappa megnyitĂˇsakor

source: Could not open the folder {0}
hu: Nem nyithatĂł meg a mappa: {0}

source: environment
hu: kĂ¶rnyezet

source: Message
hu: Ăśzenet

source: Warning
hu: FigyelmeztetĂ©s

source: Could not remove old version of {0}
hu: Nem tĂ¶rĂ¶lhetĹ‘ a {0} rĂ©gi verziĂłja

source: Could not replace {0}
hu: Nem cserĂ©lhetĹ‘: {0}

source: Could not delete {0}
hu: Nem tĂ¶rĂ¶lhetĹ‘: {0}

source: New Tab
hu: Ăšj fĂĽl

source: Rename
hu: ĂtnevezĂ©s

source: Previous Tab
hu: ElĹ‘zĹ‘ fĂĽl

source: Next Tab
hu: KĂ¶vetkezĹ‘ fĂĽl

source: Verify
hu: EllenĹ‘rzĂ©s

source: Open
hu: MegnyitĂˇs

source: New Editor Window
hu: Ăšj szerkesztĹ‘ablak

source: Open in Another Window
hu: MegnyitĂˇs Ăşj ablakban

source: No launcher available
hu: Nem indĂ­thatĂł

source: Unspecified platform, no launcher available. To enable opening URLs or folders, add a "launcher=/path/to/app" line to preferences.txt
hu: Nem ismert platform, indĂ­tĂˇs nem lehetsĂ©ges. Az URL vagy mappa megnyitĂˇsĂˇhoz a preferences.txt-ben a "launcher=/path/to/app" sor hozzĂˇadĂˇsa szĂĽksĂ©ges

source: Could not read color theme settings. You'll need to reinstall Processing.
hu: Nem olvashatĂł a szĂ­nsĂ©ma, a Processing ĂşjratelepĂ­tĂ©sĂ©re van szĂĽksĂ©g.

source: Browse
hu: TallĂłz

source: Catalan
hu: KatalĂˇn

source: Chinese Simplified
hu: EgyszerĂĽsĂ­tett kĂ­nai

source: Chinese Taiwan
hu: Taiwani kĂ­nai

source: Danish
hu: DĂˇn

source: Dutch
hu: Holland

source: English
hu: Angol

source: French
hu: Francia

source: Filipino
hu: FĂĽlĂ¶p-szigetek

source: Galician
hu: Gall

source: German
hu: NĂ©met

source: Greek
hu: GĂ¶rĂ¶g

source: Hungarian
hu: Magyar

source: Italian
hu: Olasz

source: Japanese
hu: JapĂˇn

source: Latvian
hu: Lett

source: Persian
hu: Perzsa

source: Portuguese (Brazil)
hu: PortugĂˇl (Brazil)

source: Romanian
hu: RomĂˇn

source: Russian
hu: Orosz

source: Spanish
hu: Spanyol

source: Could not read default settings. You'll need to reinstall Arduino.
hu: Az alapĂ©rtelezett beĂˇllĂ­tĂˇsok nem olvashatĂłak Az Arduino ĂşjratelepĂ­tĂ©se szĂĽksĂ©ges.

source: Could not read preferences from {0}
hu: A beĂˇllĂ­tĂˇsok nem olvashatĂłak: {0}

source: Error reading preferences
hu: AlapbeĂˇllĂ­tĂˇsok olvasĂˇsa kĂ¶zben hiba lĂ©pett fel

source: Error reading the preferences file. Please delete (or move) {0} and restart Arduino.
hu: Hiba a beĂˇllĂ­tĂˇsok olvasĂˇsa sorĂˇn. KĂ©rem tĂ¶rĂ¶lje (vagy mozgassa el) a {0} file-t Ă©s indĂ­tsa Ăşjra az Arduino-t!

source: Sketchbook location:
hu: SketchBook helye:

source: Select new sketchbook location
hu: VĂˇlasszon Ăşj SketchBook mappĂˇt

source: Editor font size:
hu: SzerkesztĹ‘ betĹ±mĂ©ret:

source: (requires restart of Arduino)
hu: (Arduino ĂşjraindĂ­tĂˇsa szĂĽksĂ©ges)

source: Show verbose output during:
hu: Log mutatĂˇsa:

source: compilation
hu: fordĂ­tĂˇskor

source: upload
hu: feltĂ¶ltĂ©skor

source: Verify code after upload
hu: KĂłd ellenĹ‘rzĂ©s feltĂ¶ltĂ©s utĂˇn

source: Use external editor
hu: KĂĽlsĹ‘ szerkesztĹ‘ hasznĂˇlata

source: Check for updates on startup
hu: Ăšjabb verziĂł ellenĹ‘rzĂ©se indĂ­tĂˇskor

source: Update sketch files to new extension on save (.pde -> .ino)
hu: Sketch frissĂ­tĂ©se az Ăşj kiterjesztĂ©ssel (.pde -> .ino)

source: Automatically associate .ino files with Arduino
hu: Automatikus kiterjesztĂ©s-hozzĂˇrendelĂ©s: .ino->Arduino

source: Preferred Language:
hu: ElĹ‘nyben rĂ©szesĂ­tett nyelv:

source: More preferences can be edited directly in the file
hu: TovĂˇbbi szĂˇmos beĂˇllĂ­tĂˇs elĂ©rhetĹ‘ a file kĂ¶zvetlen szerkesztĂ©sĂ©vel

source: (edit only when Arduino is not running)
hu: (csak akkor szerkeszthetĹ‘, ha az Arduino nem fut)

source: ignoring invalid font size {0}
hu: hibĂˇs fontmĂ©ret kihagyĂˇsa: {0}
