Repository: MhdSyrwan/IDE_translations
Catalog: Resources_*.po
Languages: hu

source: No files were added to the sketch.
hu: Nem lett file hozzĂˇadva a Sketch-hez.

source: One file added to the sketch.
hu: Egy file a Sketch-hez hozzĂˇadĂˇsra kerĂĽlt.

source: {0} files added to the sketch.
hu: {0} file a Sketch-hez hozzĂˇadĂˇsra kerĂĽlt.

source: New
hu: Ăšj

source: Open...
hu: Megnyit...

source: Examples
hu: MintĂˇk

source: Close
hu: KilĂ©pĂ©s

source: Save
hu: MentĂ©s

source: Save As...
hu: MentĂ©s mĂˇskĂ©nt...

source: Upload
hu: FeltĂ¶ltĂ©s

source: Upload Using Programmer
hu: FeltĂ¶ltĂ©s programozĂłval

source: Page Setup
hu: OldalbeĂˇllĂ­tĂˇs

source: Print
hu: NyomtatĂˇs

source: Preferences
hu: BeĂˇllĂ­tĂˇsok

source: Quit
hu: KilĂ©pĂ©s

source: Verify / Compile
hu: EllenĹ‘rzĂ©s / FordĂ­tĂˇs

source: Import Library...
hu: FĂĽggvĂ©ny importĂˇlĂˇs...

source: Show Sketch Folder
hu: Sketch mappa mutatĂˇsa

source: Add File...
hu: File hozzĂˇadĂˇsa...

source: Tools
hu: EszkĂ¶zĂ¶k

source: Serial Monitor
hu: Soros monitor

source: Board
hu: Alappanel

source: Serial Port
hu: Soros port

source: Programmer
hu: ProgramozĂł

source: Burn Bootloader
hu: Bootloader beĂ©getĂ©se

source: serialMenu is null
hu: Ăśres a serialMenĂĽ

source: name is null
hu: a nĂ©v: ĂĽres(nincs megadva)

source: error retrieving port list
hu: hiba a portlista lekĂ©rĂ©sekor

source: Help
hu: SĂşgĂł

source: Getting Started
hu: ElsĹ‘ lĂ©pĂ©sek

source: Environment
hu: KĂ¶rnyezet

source: Troubleshooting
hu: HibaelhĂˇrĂ­tĂˇs

source: Reference
hu: Referencia

source: Find in Reference
hu: KeresĂ©s a ReferenciĂˇk kĂ¶zt

source: Frequently Asked Questions
hu: Gyakran IsmĂ©telt KĂ©rdĂ©sek

source: Visit Arduino.cc
hu: arduino.cc honlap megnyitĂˇsa

source: About Arduino
hu: Arduino nĂ©vjegye

source: Edit
hu: SzerkesztĂ©s

source: Undo
hu: MĂ©gse

source: Redo
hu: MĂ©gis

source: Cut
hu: KivĂˇgĂˇs

source: Copy
hu: MĂˇsolĂˇs

source: Copy for Forum
hu: MĂˇsolĂˇs a FĂłrumhoz

source: Copy as HTML
hu: MĂˇsolĂˇs HTML-kĂ©nt

source: Paste
hu: BeillesztĂ©s

source: Select All
hu: Minden kijelĂ¶lĂ©se

source: Comment/Uncomment
hu: MegjegyzĂ©s/MĂ©gsem

source: Increase Indent
hu: BehĂşzĂˇs nĂ¶velĂ©se

source: Decrease Indent
hu: BehĂşzĂˇs csĂ¶kkentĂ©se

source: Find...
hu: KeresĂ©s...

source: Find Next
hu: KĂ¶vetkezĹ‘ keresĂ©se

source: Find Previous
hu: ElĹ‘zĹ‘ keresĂ©se

source: Use Selection For Find
hu: KivĂˇlasztĂˇs hasznĂˇlata keresĂ©shez

source: First select a word to find in the reference.
hu: ElĹ‘szĂ¶r egy szĂłt kell vĂˇlasztani a ReferenciĂˇk kĂ¶zti keresĂ©shez.

source: No reference available for "{0}"
hu: Referencia nem talĂˇlhatĂł a {0} bejegyzĂ©shez

source: Compiling sketch...
hu: Sketch fordĂ­tĂˇsa...

source: Done compiling.
hu: FordĂ­tĂˇs kĂ©sz.

source: Save changes to "{0}"?
hu: MentĂ©s a {0} ĂˇllomĂˇnyba?

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Do you want to save changes to this sketch<BR> before closing?</b><p>If you don't save, your changes will be lost.
hu: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>VĂˇltoztatĂˇs mentĂ©se a kilĂ©pĂ©s elĹ‘tt a Sketch-be?</b><p>MentĂ©s nĂ©kĂĽl a vĂˇltoztatĂˇsok elvesznek.

source: Cancel
hu: MĂ©gse

source: Don't Save
hu: Nincs mentĂ©s

source: Bad file selected
hu: HibĂˇs file lett kivĂˇlasztva

source: Processing can only open its own sketches and other files ending in .ino or .pde
hu: Processing csak a sajĂˇt ĂˇllomĂˇnyĂˇt tudja megnyitni vagy az .ino vagy .pde kiterjesztĂ©sĹ±eket

source: The file "{0}" needs to be inside a sketch folder named "{1}". Create this folder, move the file, and continue?
hu: A "{0}" file-nak a(z) {1} mappĂˇn belĂĽl kell lennie. Mi legyen? Mappa lĂ©trehozĂˇsa, file mozgatĂˇsa Ă©s folytatĂˇs?

source: Moving
hu: ĂtmozgatĂˇs

source: Error
hu: Hiba

source: A folder named "{0}" already exists. Can't open sketch.
hu: A {0} mappa mĂˇr lĂ©tezik. Sketch nem nyithatĂł meg.

source: Could not create the sketch folder.
hu: Sketch mappĂˇja nem hozhatĂł lĂ©tre.

source: Could not copy to a proper location.
hu: Nem mĂˇsolhatĂł a megfelelĹ‘ helyre.

source: Could not create the sketch.
hu: Sketch nem hozhatĂł lĂ©tre.

source: Saving...
hu: MentĂ©s...

source: Done Saving.
hu: MentĂ©s kĂ©sz.

source: Save Canceled.
hu: MentĂ©s megszakĂ­tva.

source: Serial port {0} not found. Retry the upload with another serial port?
hu: {0} soros port nem talĂˇlhatĂł. MĂˇsik soros porton megismĂ©teljĂĽk?

source: Uploading to I/O Board...
hu: FeltĂ¶ltĂ©s alappanelre...

source: Done uploading.
hu: FeltĂ¶ltĂ©s kĂ©sz.

source: Upload canceled.
hu: FeltĂ¶ltĂ©s megszakĂ­tva.

source: Save changes before export?
hu: ExportĂˇlĂˇs elĹ‘tt mentĂ©s?

source: Export canceled, changes must first be saved.
hu: ExportĂˇlĂˇs megszakĂ­tva. ElĹ‘szĂ¶r menteni kell!

source: Burning bootloader to I/O Board (this may take a minute)...
hu: Bootloader Ă©getĂ©se (nĂ©hĂˇny percet vesz igĂ©nybe)...

source: Done burning bootloader.
hu: Bootloader Ă©getĂ©s kĂ©sz.

source: Error while burning bootloader.
hu: Hiba lĂ©pett fel a bootloader Ă©getĂ©sekor.

source: Printing...
hu: NyomtatĂˇs...

source: Done printing.
hu: NyomtatĂˇs kĂ©sz.

source: Error while printing.
hu: Hiba a nyomtatĂˇs sorĂˇn.

source: Printing canceled.
hu: NyomtatĂˇs megszakĂ­tva.

source: Bad error line: {0}
hu: HibĂˇs sor: {0}

source: Open URL
hu: URL megnyitĂˇsa

source: A new version of Arduino is available, would you like to visit the Arduino download page?
hu: Ăšj kiadĂˇs jelent meg Arduino-bĂłl, megmutassam a letĂ¶ltĂ©si oldalt?

source: Yes
hu: Igen

source: No
hu: Nem

source: Update
hu: FrissĂ­tĂ©s

source: Find:
hu: KeresĂ©s:

source: Replace with:
hu: Csere erre:

source: Ignore Case
hu: KisbetĹ±-nagybetĹ± fĂĽggetlen

source: Wrap Around
hu: Teljesen szĂ¶vegben

source: Replace All
hu: Mindent cserĂ©l

source: Replace
hu: CserĂ©l

source: Replace & Find
hu: Keres Ă©s cserĂ©l

source: Previous
hu: ElĹ‘zĹ‘

source: Find
hu: Keres

source: Send
hu: KĂĽld

source: Autoscroll
hu: AutogĂ¶rgetĂ©s

source: No line ending
hu: Nincs sorlezĂˇrĂˇs

source: Newline
hu: SoremelĂ©s

source: Carriage return
hu: Kocsi-vissza

source: Both NL & CR
hu: SoremelĂ©s Ă©s Kocsi-vissza

source: Serial port ''{0}'' already in use. Try quiting any programs that may be using it.
hu: A {0} soros port hasznĂˇlatban van. A programbĂłl valĂłkilĂ©pĂ©s utĂˇn prĂłbĂˇlja Ăşjra.

source: Error opening serial port ''{0}''.
hu: Hiba a {0} soros port megnyitĂˇsa sorĂˇn.

source: Serial port ''{0}'' not found. Did you select the right one from the Tools > Serial Port menu?
hu: A {0} soros port nem talĂˇlhatĂł. VĂˇlasztani az EszkĂ¶zĂ¶k > Soros port alatt lehetsĂ©ges.

source: readBytesUntil() byte buffer is too small for the {0} bytes up to and including char {1}
hu: readBytesUntil() byte buffer tĂşl kicsi {0} byte befogadĂˇsĂˇra Ă©s ideĂ©rtve a {1} karaktert

source: Error inside Serial.{0}()
hu: Hiba a Serial.{0}()-ban

source: Auto Format
hu: AutoformĂˇzĂˇs

source: No changes necessary for Auto Format.
hu: Nem szĂĽksĂ©ges semmilyen vĂˇltoztatĂˇs autoformĂˇzĂˇshoz.

source: Auto Format Canceled: Too many right parentheses.
hu: AutoformĂˇzĂˇs megszakĂ­tva: tĂşl sok a zĂˇrĂł zĂˇrĂłjel.

source: Auto Format Canceled: Too many left parentheses.
hu: AutoformĂˇzĂˇs megszakĂ­tva: tĂşl sok a nyitĂł zĂˇrĂłjel.

source: Auto Format Canceled: Too many right curly braces.
hu: AutoformĂˇzĂˇs megszakĂ­tva: tĂşl sok zĂˇrĂł kapcsos-zĂˇrĂłjel.

source: Auto Format Canceled: Too many left curly braces.
hu: AutoformĂˇzĂˇs megszakĂ­tva: tĂşl sok nyitĂł kapcsos-zĂˇrĂłjel.

source: Auto Format finished.
hu: AutoformĂˇzĂˇs befejezĹ‘dĂ¶tt.

source: Fix Encoding & Reload
hu: BetĂ¶ltĂ©skor autoformĂˇzĂˇs

source: Discard all changes and reload sketch?
hu: MĂłdosĂ­tĂˇsok elvetĂ©se Ă©s Sketch ĂşjratĂ¶ltĂ©se?

source: An error occurred while trying to fix the file encoding. Do not attempt to save this sketch as it may overwrite the old version. Use Open to re-open the sketch and try again.
hu: Hiba lĂ©pett fel a file fixĂˇlĂˇsa/javĂ­tĂˇsa sorĂˇn. Nem javasolt a felĂĽlĂ­rĂˇsos mentĂ©s. A Sketch Ăşjra-megnyitĂˇsa talĂˇn megoldja a problĂ©mĂˇt.

source: Archive Sketch
hu: Sketch archivĂˇlĂˇs

source: Couldn't archive sketch
hu: Sketch nem archivĂˇlhatĂł

source: Archiving the sketch has been canceled because the sketch couldn't save properly.
hu: A Sketch archivĂˇlĂˇsa megszakadt, mivel a Sketch pontos mentĂ©se nem volt lehetsĂ©ges.

source: Archive sketch as:
hu: Sketch archivĂˇlĂˇsa, mint:

source: Archive sketch canceled.
hu: Sketch archivĂˇlĂˇs megszakĂ­tva.

source: Error while loading code {0}
hu: Hiba a kĂłd betĂ¶ltĂ©se kĂ¶zben: {0}

source: "{0}" contains unrecognized characters.If this code was created with an older version of Processing,you may need to use Tools -> Fix Encoding & Reload to updatethe sketch to use UTF-8 encoding. If not, you may need todelete the bad characters to get rid of this warning.
hu: A {0} nem felismerhetĹ‘ karaktert tartalmaz. Ha a kĂłd rĂ©gebbi verziĂłjĂş Processing-gel kĂ©szĂĽlt, akkor az EszkĂ¶zĂ¶k -> BetĂ¶ltĂ©skor autoformĂˇzĂˇs menĂĽpont megoldja az UTF-8 kĂłdolĂˇst. Ha mĂ©gsem, akkor a hibĂˇs karaktert ki kell tĂ¶rĂ¶lni az ĂˇllomĂˇnybĂłl.

source: Sketch is Read-Only
hu: Sketch csak olvashatĂł

source: Some files are marked "read-only", so you'll need to re-save the sketch in another location, and try again.
hu: NĂ©hĂˇny file csak olvashatĂł, Ă­gy mĂˇs helyre mentĂ©s utĂˇn Ăşjra meg kell prĂłbĂˇlni.

source: Name for new file:
hu: Ăšj file neve:

source: Sketch is Untitled
hu: A Sketch most NĂ©vtelen (Untitled)

source: How about saving the sketch first before trying to rename it?
hu: A Sketch csak mentĂ©s utĂˇn nevezhetĹ‘ Ăˇt!

source: Problem with rename
hu: Hiba az ĂˇtnevezĂ©s sorĂˇn

source: The name cannot start with a period.
hu: A nĂ©v nem kezdĹ‘dhet periĂłdus-jellel.

source: ".{0}" is not a valid extension.
hu: ".{0}" nem megfelelĹ‘ kiterjesztĂ©s.

source: The main file can't use an extension. (It may be time for your to graduate to a "real" programming environment)
hu: A fĹ‘-file nem tartalmazhat kiterjesztĂ©st. (TalĂˇn itt az idĹ‘, hogy megismerje a "valĂłdi" programozĂˇsi kĂ¶rnyezetet)

source: Nope
hu: Dehogy, nem

source: A file named "{0}" already exists in "{1}"
hu: A "{0}" file mĂˇr lĂ©tezik a "{1}" mappĂˇban!

source: You can't have a .cpp file with the same name as the sketch.
hu: Nem lehet azonos nĂ©ven a .cpp ĂˇllomĂˇny, mint a Sketch.

source: You can't rename the sketch to "{0}" because the sketch already has a .cpp file with that name.
hu: Nem nevezhetĹ‘ Ăˇt a Sketch, mert lĂ©tezik a "{0}" nevĹ± .cpp ĂˇllomĂˇny.

source: Cannot Rename
hu: ĂtnevezĂ©si hiba

source: Sorry, a sketch (or folder) named "{0}" already exists.
hu: Hiba: Sketch (vagy mappa) mĂˇr lĂ©tezik "{0}" nĂ©ven.

source: Could not rename the sketch. (0)
hu: A Sketch nem nevezhetĹ‘ Ăˇt: (0).

source: Could not rename "{0}" to "{1}"
hu: Nem nevezhetĹ‘ Ăˇt: "{0}" -> "{1}"

source: Could not rename the sketch. (1)
hu: Nem nevezhetĹ‘ Ăˇt a Sketch: (1)

source: Could not rename the sketch. (2)
hu: Nem nevezhetĹ‘ Ăˇt a Sketch: (2).

source: createNewFile() returned false
hu: a createNewFile() hibĂˇt jelzett

source: Are you sure you want to delete this sketch?
hu: TĂ©nyleg tĂ¶rĂ¶lni kell a Sketch-et? Biztosan?

source: Are you sure you want to delete "{0}"?
hu: A(z) "{0}" ĂˇllomĂˇny tĂ©nyleg tĂ¶rlĂ©sre kerĂĽljĂ¶n?

source: Delete
hu: TĂ¶rlĂ©s

source: Couldn't do it
hu: Nem tudom megtenni

source: Could not delete "{0}".
hu: Nem tĂ¶rĂ¶lhetĹ‘ file: "{0}".

source: removeCode: internal error.. could not find code
hu: removeCode: belsĹ‘ hiba... KĂłd nem talĂˇlhatĂł

source: Sketch is read-only
hu: A Sketch csak olvashatĂł

source: Some files are marked "read-only", so you'll need to re-save this sketch to another location.
hu: NĂ©hĂˇny file csak olvashatĂł, Ă­gy el kell menteni a Sketch-et egy mĂˇsik mappĂˇba.

source: In Arduino 1.0, the default file extension has changed from .pde to .ino. New sketches (including those created by "Save-As" will use the new extension. The extension of existing sketches will be updated on save, but you can disable this in the Preferences dialog. Save sketch and update its extension?
hu: Az Arduino 1.0-ban az alappĂ©rtelmezett kiterjesztĂ©s megvĂˇltozott .pde-rĹ‘l .ino-ra. Az Ăşj Sketck-ek (ideĂ©rtve a MentĂ©s mĂˇskĂ©nt... lĂ©trehozottakat is) mĂˇr az Ăşj kiterjesztĂ©st hasznĂˇljĂˇk. A mentĂ©s kĂ¶zbeni ĂˇtnevezĂ©s tilthatĂł a BeĂˇllĂ­tĂˇsok menĂĽpontban. Sketch mentĂ©se Ă©s kiterjesztĂ©s frissĂ­tĂ©se?

source: Save sketch folder as...
hu: Sketch mentĂ©se, mint...

source: You can't save the sketch as "{0}" because the sketch already has a .cpp file with that name.
hu: Sketch nem menthetĹ‘, mint "{0}" mert mĂˇr van ilyen .cpp ĂˇllomĂˇny.

source: How very Borges of you
hu: Nono!

source: You cannot save the sketch into a folder inside itself. This would go on forever.
hu: Sketch nem menthetĹ‘ a mappĂˇba. ĂŤgy egy vĂ©gtelen tĂ¶rtĂ©nettĂ© alakulna.

source: Select an image or other data file to copy to your sketch
hu: KĂ©p vagy egyĂ©b adat vĂˇlasztĂˇsa a Sketch-be mĂˇsolĂˇshoz

source: Replace the existing version of {0}?
hu: A meglevĹ‘ {0} cserĂ©je?

source: Error adding file
hu: File hozzĂˇadĂˇsi hiba

source: Could not delete the existing ''{0}'' file.
hu: Nem tĂ¶rĂ¶lhetĹ‘ a meglevĹ‘ {0} file.

source: You can't fool me
hu: Ne bolondozzon velem

source: This file has already been copied to the location from which where you're trying to add it. I ain't not doin nuthin'.
hu: A file mĂˇr mĂˇsolĂˇsra kerĂĽlt a mappĂˇba ahonnan hozzĂˇ prĂłbĂˇlta adni. MĂ©g mindig nem vĂ©grehajthatĂł.

source: Could not add ''{0}'' to the sketch.
hu: A {0} nem adhatĂł hozzĂˇ a Sketch-hez.

source: Build folder disappeared or could not be written
hu: A fordĂ­tĂˇsi mappa elĂ©rhetetlen vagy Ă­rĂˇsvĂ©dett.

source: Could not find main class
hu: A fĹ‘ programosztĂˇly (main class) nem talĂˇlhatĂł

source: Uncaught exception type: {0}
hu: HibĂˇs kivĂ©tel tĂ­pus: {0}

source: Problem moving {0} to the build folder
hu: Hiba a {0} fordĂ­tĂˇsi mappĂˇba mozgatĂˇsa sorĂˇn

source: Uploading...
hu: FeltĂ¶ltĂ©s...

source: Binary sketch size: {0} bytes (of a {1} byte maximum)
hu: Sketch mĂ©rete: {0} byte (maximĂˇlisan lehetsĂ©ges: {1} byte)

source: Couldn't determine program size: {0}
hu: Nem meghatĂˇrozhatĂł a {0} program mĂ©rete

source: Sketch too big; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing it.
hu: TĂşl nagy a Sketch: mĂ©ret csĂ¶kkentĂ©sĂ©hez a http://www.arduino.cc/en/Guide/Troubleshooting#size oldalon talĂˇlhatĂłak tippek.

source: Missing the */ from the end of a /* comment */
hu: HiĂˇnyzik a megjegyzĂ©st zĂˇrĂł */ jel

source: Sketch Disappeared
hu: A Sketch elveszett

source: The sketch folder has disappeared. Will attempt to re-save in the same location, but anything besides the code will be lost.
hu: A Sketch mappĂˇja elveszett. A Sketch ĂşjramentĂ©sre kerĂĽl, a kĂłd egyes rĂ©szei megsemmisĂĽlhettek.

source: Could not re-save sketch
hu: Nem lehetsĂ©ges a Sketch ĂşjramentĂ©se

source: Could not properly re-save the sketch. You may be in trouble at this point, and it might be time to copy and paste your code to another text editor.
hu: TĂ¶kĂ©letesen nem lehetsĂ©ges a Sketch ĂşjramentĂ©se. A megoldĂˇs jelen helyzetben, hogy a szerkesztĹ‘bĹ‘l a kĂłdot kimĂˇsolja egy mĂˇsik szerkesztĹ‘programba.

source: The sketch name had to be modified. Sketch names can only consist of ASCII characters and numbers (but cannot start with a number). They should also be less less than 64 characters long.
hu: A Sketch neve mĂłdosĂ­tĂˇsra kerĂĽlt. Az elnevezĂ©se csak ASCII betĹ±ket, szĂˇmokat tartalmazhat (de nem kezdĹ‘dhet szĂˇmmal). Valamint a nĂ©v hossza nem haladhatja meg a 64 karaktert.

source: Compiler error, please submit this code to {0}
hu: FordĂ­tĂˇsi hiba, ezt a kĂłdot kĂ©rem kĂĽldje el a {0} cĂ­mre

source: the selected serial port {0} does not exist or your board is not connected
hu: kivĂˇlasztott {0} port nem elĂ©rhetĹ‘ vagy az alappanel nincs csatlakoztatva

source: Device is not responding, check the right serial port is selected or RESET the board right before exporting
hu: EszkĂ¶z nem vĂˇlaszol: talĂˇn hibĂˇs port lett kivĂˇlasztva, vagy a panelĂşjraindĂ­tĂˇsa szĂĽksĂ©ges exportĂˇlĂˇs elĹ‘tt

source: Problem uploading to board. See http://www.arduino.cc/en/Guide/Troubleshooting#upload for suggestions.
hu: Hiba a feltĂ¶ltĂ©s sorĂˇn. A hiba elhĂˇrĂ­tĂˇsa a http://www.arduino.cc/en/Guide/ oldalon a Troubleshooting#upload alatt kerĂĽlt leĂ­rĂˇsra.

source: Wrong microcontroller found. Did you select the right board from the Tools > Board menu?
hu: Nem megfelelĹ‘ mikrokontroller lett kivĂˇlasztva. PontosĂ­tani az EszkĂ¶zĂ¶k > Alappanelek menĂĽben lehet.

source: No board selected; please choose a board from the Tools > Board menu.
hu: Nincs alappanel kivĂˇlasztva. VĂˇlasztani az EszkĂ¶zĂ¶k > Alappanel menĂĽbĹ‘l lehet.

source: {0} returned {1}
hu: {0} eredmĂ©nye {1}

source: Error compiling.
hu: Hiba a fordĂ­tĂˇs sorĂˇn.

source: Please import the SPI library from the Sketch > Import Library menu.
hu: Az SPI fĂĽggvĂ©nyek hasznĂˇlatĂˇhoz a Sketch > FĂĽggvĂ©ny import alatt az SPI-re van szĂĽksĂ©ge.

source: As of Arduino 0019, the Ethernet library depends on the SPI library. You appear to be using it or another library that depends on the SPI library.
hu: Az Arduino-0019 Ăłta az Ethernet fĂĽggvĂ©nyek kapcsolĂłdnak az SPI fĂĽggvĂ©nyekhez. Ez Ă­gy hasznĂˇlhatĂł, vagy mĂˇsik fĂĽggvĂ©ny alkalmazhatĂł az SPI kezelĂ©sĂ©re.

source: The 'BYTE' keyword is no longer supported.
hu: A 'BYTE' kulcsszĂł nem tĂˇmogatott.

source: As of Arduino 1.0, the 'BYTE' keyword is no longer supported. Please use Serial.write() instead.
hu: Az Arduino 1.0 alatt a 'BYTE' kulcsszĂł nem tĂˇmogatott. Helyette a Serial.write() hasznĂˇlhatĂł.

source: The Server class has been renamed EthernetServer.
hu: A Server fĂĽggvĂ©nyosztĂˇly EthernetServer nĂ©vre hallgat.

source: As of Arduino 1.0, the Server class in the Ethernet library has been renamed to EthernetServer.
hu: Az Arduino 1.0-ban, az Ethernet fĂĽggvĂ©ny Server osztĂˇlya EthernetServer-re vĂˇltozott.

source: The Client class has been renamed EthernetClient.
hu: A Client osztĂˇly Ăşj neve: EthernetClient

source: As of Arduino 1.0, the Client class in the Ethernet library has been renamed to EthernetClient.
hu: Az Arduino 1.0-ban az Ethernet fĂĽggvĂ©ny Client osztĂˇly Ăşj neve: EthernetClient.

source: The Udp class has been renamed EthernetUdp.
hu: Az Udp osztĂˇly Ăşj neve: EthernetUdp.

source: As of Arduino 1.0, the Udp class in the Ethernet library has been renamed to EthernetClient.
hu: Az Arduino 1.0-ban az Ethernet fĂĽggvĂ©ny Udp osztĂˇly Ăşj neve: EthernetUdp.

source: Wire.send() has been renamed Wire.write().
hu: A Wire.send() Ăşj neve: Wire.write().

source: As of Arduino 1.0, the Wire.send() function was renamed to Wire.write() for consistency with other libraries.
hu: Az Arduino 1.0-ban a Wire.send() funkciĂł Ăşn neve: Wire.write(), az egyĂ©b fĂĽggvĂ©nyekkel analĂłg mĂłdon.

source: Wire.receive() has been renamed Wire.read().
hu: A Wire.receive() Ăşj neve: Wire.read().

source: As of Arduino 1.0, the Wire.receive() function was renamed to Wire.read() for consistency with other libraries.
hu: Az Arduino 1.0-ban a Wire.receive() funkciĂł Ăşn neve: Wire.read(), az egyĂ©b fĂĽggvĂ©nyekkel analĂłg mĂłdon.

source: Console Error
hu: Konzol hiba

source: A problem occurred while trying to open the files used to store the console output.
hu: Hiba lĂ©pett fel, mikĂ¶zben a megnyitott file a konzolt hasznĂˇlta volna.

source: Non-fatal error while setting the Look & Feel.
hu: Nem-vĂ©gzetes hiba a kinĂ©zet beĂˇllĂ­tĂˇsa sorĂˇn (a program fĂ©rfi gĂ©neket hordoz).

source: The error message follows, however Arduino should run fine.
hu: A hibaĂĽzenetet kĂ¶vetĹ‘en az Arduino megfelelĹ‘en mĹ±kĂ¶dik.

source: Problem Setting the Platform
hu: A keretrendszer konfigurĂˇlĂˇsa sorĂˇn hiba lĂ©pett fel

source: An unknown error occurred while trying to load platform-specific code for your machine.
hu: RendszerfĂĽggĹ‘ kĂłd betĂ¶ltĂ©se sorĂˇn hiba lĂ©pett fel (A hiba az Ă–n gĂ©pĂ©ben van.)

source: Please install JDK 1.5 or later
hu: A futtatĂˇshoz telepĂ­tett Java 1.5 vagy Ăşjabb szoftverkĂ¶rnyezet szĂĽksĂ©ges

source: Arduino requires a full JDK (not just a JRE) to run. Please install JDK 1.5 or later. More information can be found in the reference.
hu: Az Arduino futtatĂˇsĂˇhoz teljes telepĂ­tĂ©sĹ± JDK (Java FejlesztĹ‘i KĂ¶rnyezet)szĂĽksĂ©ges, nem elegendĹ‘ csak a JRE (Java futtatĂłkĂ¶rnyezet)A JDK 1.5 vagy Ăşjabb szofver telepĂ­tĂ©se szĂĽksĂ©gesBĹ‘vebb informĂˇciĂł a ReferenciĂˇk kĂ¶zt talĂˇlhatĂł.

source: Sketchbook folder disappeared
hu: A SketchBook mappa elĂ©rhetetlen

source: The sketchbook folder no longer exists. Arduino will switch to the default sketchbook location, and create a new sketchbook folder if necessary. Arduino will then stop talking about himself in the third person.
hu: A SketchBook mappa nem Ă©rhetĹ‘ el. Az alapĂ©rtelmezett hely lesz kivĂˇlasztva, Ă©s itt lĂ©trehozva a sketch mappa.

source: Time for a Break
hu: Itt az idĹ‘ szĂĽnetet tartani

source: You've reached the limit for auto naming of new sketches for the day. How about going for a walk instead?
hu: Meghaladtad az egy napra jutĂł Ăşj Sketch-ek lĂ©trehozĂˇsi szĂˇmĂˇt. Nem kĂ©ne sĂ©tĂˇlni egyet - pihenĂ©sĂĽl?

source: Sunshine
hu: NapfĂ©ny

source: No really, time for some fresh air for you.
hu: HoppĂˇ, itt az idĹ‘ levegĹ‘znĂ¶d egyet.

source: Open an Arduino sketch...
hu: Arduino Sketch megnyitĂˇsa...

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Are you sure you want to Quit?</b><p>Closing the last open sketch will quit Arduino.
hu: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Biztosan ki akarsz lĂ©pni?</b><p>Az utolsĂł Sketch bezĂˇrĂˇsĂˇval az Arduino kilĂ©p.

source: Contributed
hu: HozzĂˇadĂˇs

source: Sketch Does Not Exist
hu: Sketch nem megnyithatĂł

source: The selected sketch no longer exists. You may need to restart Arduino to update the sketchbook menu.
hu: A kivĂˇlasztott Sketch nem Ă©rhetĹ‘ el. A SketchBook menĂĽ frissĂ­tĂ©sĂ©hez az Arduino ĂşjraindĂ­tĂˇsa szĂĽksĂ©ges.

source: The sketch "{0}" cannot be used. Sketch names must contain only basic letters and numbers (ASCII-only with no spaces, and it cannot start with a number). To get rid of this message, remove the sketch from {1}
hu: A "{0}" Sketch nem hasznĂˇlhatĂł. A Sketch neve csak angol abc betĹ±it, szĂˇmokat tartalmazhat, szĂłkĂ¶z nĂ©lkĂĽl Ă©s az elsĹ‘ betĹ±je nem lehet szĂˇm. A hibĂˇs Sketch-et tĂˇvolĂ­tsd el a(z) {1} mappĂˇbĂłl!

source: Ignoring sketch with bad name
hu: HibĂˇs Sketch nĂ©v kihagyĂˇsa

source: The library "{0}" cannot be used. Library names must contain only basic letters and numbers. (ASCII only and no spaces, and it cannot start with a number)
hu: A "{0}" kĂ¶nyvtĂˇr nem hasznĂˇlhatĂł. A neve az angol abc betĹ±it Ă©s szĂˇmokat tartalmazhat (szĂłkĂ¶z nem lehet benne Ă©s nem kezdĹ‘dhet szĂˇmmal).

source: Ignoring bad library name
hu: HibĂˇs kĂ¶nyvtĂˇrnĂ©v kihagyĂˇsa

source: Problem getting data folder
hu: ProblĂ©ma a kĂ¶nyvtĂˇr elĂ©rĂ©sekor

source: Error getting the Arduino data folder.
hu: Hiba az Arduino data kĂ¶nyvtĂˇr elĂ©rĂ©sekor.

source: Settings issues
hu: Kimenetek beĂˇllĂ­tĂˇsa

source: Arduino cannot run because it could not create a folder to store your settings.
hu: Arduino nem futtathatĂł, mert nem hozhatĂł lĂ©tre a felhasznĂˇlĂłi beĂˇllĂ­tĂˇsok mappĂˇja.

source: You forgot your sketchbook
hu: Felejtsd el a SketchBook-ot
